app/controllers/home_controller.rb

SELECT * FROM `products` WHERE (`products`.user_id = 1) ORDER BY products.id DESC LIMIT 1
SELECT * FROM `profiles` WHERE (`profiles`.user_id = 1) LIMIT 1
SELECT count(*) AS count_all FROM `products` WHERE (`products`.user_id = 1)
---
  def index
    flash.discard
    if logged_in?
      if current_user.profile.nil?
        render :template => "users/profile"
      elsif current_user.products.size <= 0

SELECT * FROM `products` WHERE (`products`.user_id = 1) ORDER BY products.id DESC LIMIT 1
---
  def notifications
    @notifications = [["profile", current_user.profile.created_at], ["prices", current_user.products.last.created_at]]

SELECT count(*) AS count_all FROM `offers` WHERE (response <> 'expired' and Date(offers.updated_at) = '2011-05-10')
---
  def analytics
    @today = Date.today-1.day
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @size = 6
    @per_page = 1
    @post_pages = (@size.to_f/@per_page).ceil;
    @page =1 if @page.to_i<=0 or @page.to_i > @post_pages
    @titleX = "Time Period"
    @titleY = "#"
    @colors = []
    @i = 0

    case @page
      when @i+=1
        @title = "# Of coupons viewed"
        @offers_a = Offer.count(:conditions => ["response <> ?", "expired"])

SELECT * FROM `products` LIMIT 0,1
SELECT count(*) AS count_all FROM `products`
---
  def say_your_price
    if logged_in?
      redirect_to root_path
      return
    end
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @size = Product.count.to_i

SELECT * FROM `payments` ORDER BY id desc LIMIT 100
---
  def winners
    @payments = Payment.all(:order => "id desc", :limit => 100)

SELECT COUNT(id) as total FROM `offers` WHERE ((updated_at >= '2011-05-10 00:00:00' and updated_at <= '2011-05-10 23:59:59') and response LIKE 'paid' and price =11) LIMIT 1
---
	def send_daily_report
    recipients = "abstartup@gmail.com, dhaval.parikh33@gmail.com, Summer_Riley@gap.com, Deepta_Banerjee@gap.com, Meena_Anvary@gap.com, dealkat2@gmail.com"
#    recipients = "abstartup@gmail.com, dhaval.parikh33@gmail.com"
#    recipients = "mailtoankitparekh@gmail.com, dhaval.parikh33@gmail.com"

    start_time = DateTime.now.utc.beginning_of_day - 1.day
    end_time = DateTime.now.utc.end_of_day - 1.day
#    @today = DateTime.now.in_time_zone("Pacific Time (US & Canada)")
    @today = Date.today-1.day

    @todays_dollars = Offer.first(:select => "SUM(price) as total", :conditions => ["(updated_at >= ? and updated_at <= ?) and response LIKE 'paid'", start_time, end_time]).total.to_f

SELECT COUNT(id) as total FROM `offers` WHERE ((CONVERT_TZ(updated_at, '+0:00', '-7:00') >= '2011-05-11 00:00:00' and CONVERT_TZ(updated_at, '+0:00', '-7:00') <= '2011-05-11 23:59:59') and response LIKE 'paid' and price =11) LIMIT 1
---
	def daily_report
    start_time = DateTime.now.utc.beginning_of_day - 1.day
    end_time = DateTime.now.utc.end_of_day - 1.day
#    @today = DateTime.now.in_time_zone("Pacific Time (US & Canada)")
    @today = Date.today-1.day

    @todays_dollars = Offer.first(:select => "SUM(price) as total", :conditions => ["(updated_at >= ? and updated_at <= ?) and response LIKE 'paid'", start_time, end_time]).total.to_f