app/controllers/products_controller.rb

  def payments
    if request.post?
      if params[:payment]
        @payment = Payment.find(params[:id])
        if @payment.update_attributes(params[:payment])
          Notification.deliver_sendcoupon(@payment.email, @payment)
          flash[:notice] = "Thank you for playing! You will get your coupon soon!"
          redirect_to say_your_price_path
          return
        else
          @payment.email = nil
          flash[:error]= "Hi, please enter a valid email address"
          return
        end
      else
        @offer = Offer.find_by_id(params[:id].to_i)
        if @offer.nil?
          redirect_to root_path
          return
        end
      end

      @payment = @offer.payment
      if @payment.nil?
        @promotion_code = PromotionCode.first(:conditions => ["price_point = ? and used = 0", @offer.price])
        if @promotion_code
          @payment = Payment.create(:offer_id => @offer.id, :promotion_code_id => @promotion_code.id)
          @payment.update_attributes(:expiry => @payment.new_expiry_date)
---
SELECT * FROM `payments` WHERE (`payments`.offer_id = 109) LIMIT 1
UPDATE `payments` SET `updated_at` = '2011-05-11 05:40:09', `email` = 'dhaval.parikh33@gmail.com' WHERE `id` = 12
SELECT * FROM `offers` WHERE (`offers`.`id` = 109) LIMIT 1
SELECT * FROM `promotion_codes` WHERE (price_point = 31.0 and used = 0) LIMIT 1
INSERT INTO `payments` (`created_at`, `updated_at`, `expiry`, `offer_id`, `promotion_code_id`, `email`) VALUES('2011-05-11 05:28:06', '2011-05-11 05:28:06', NULL, 109, 405368, NULL)
UPDATE `offers` SET `updated_at` = '2011-05-11 05:28:06', `response` = 'paid' WHERE `id` = 109
UPDATE `promotion_codes` SET `updated_at` = '2011-05-11 05:28:06', `used` = 1 WHERE `id` = 405368

  def download_pdf
    if params[:id]
      @payment = Payment.find_by_id(params[:id])
---
SELECT * FROM `payments` WHERE (`payments`.`id` = '15') LIMIT 1

  def capsule
    if params[:id]
      @product = Product.find_by_id(params[:id])
      if @product.nil?
        redirect_to root_path
        return
      end
      offer_token = (session[:_csrf_token] ||= ActiveSupport::SecureRandom.base64(32))

      @last_offer = @product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token])
      if request.post?
        if @last_offer and @last_offer.accepted?
          return
        end
        if params[:submit_button]
          submit = params[:submit_button].strip.downcase
          if ["yes", "no"].include? submit
            return if @last_offer.nil?
            if submit == "no"
              @last_offer.update_attribute(:response, "rejected")
              flash[:error] = "Sorry we can't make a deal right now. Try again later?"
            elsif submit == "yes"
              @last_offer.update_attribute(:response, "accepted")
              flash[:notice] = (@last_offer.price == 0) ? "Cool! Congrats! you won free Gap khakis. Share with facebook /twitter friends!" : "Cool, come on down to the store!"
            end
            for offer in @product.offers.all(:conditions => ["ip = ? and token = ? and id < ? and (response IS NULL OR response LIKE 'counter')", request.remote_ip, offer_token, @last_offer.id])
---
SELECT * FROM `products` WHERE (`products`.`id` = '1') LIMIT 1
SELECT * FROM `offers` WHERE (`offers`.product_id = 1 AND (ip = '172.18.100.97' and token = 'Y4KSBf/dKOvG8+TVDhYyzC/v3S2NtynrMn6UnL+NUdE=' and response IS NULL)) ORDER BY offers.id DESC LIMIT 1
SELECT AVG(price) as avg_price FROM `offers` WHERE (`offers`.product_id = 1 AND (response = 'paid')) ORDER BY offers.id DESC LIMIT 1
UPDATE `offers` SET `updated_at` = '2011-05-11 05:28:02', `response` = 'last', `price` = 31.0 WHERE `id` = 109
SELECT * FROM `offers` WHERE (ip = '172.18.100.97' and token = 'Y4KSBf/dKOvG8+TVDhYyzC/v3S2NtynrMn6UnL+NUdE=' and id <= 112 and (response IS NULL OR response LIKE 'counter')) AND (`offers`.product_id = 2)

              end
          else
              @last_offer = Offer.new(:ip => request.remote_ip, :token => offer_token, :product_id => @product.id, :price => price, :counter => 1)
              @last_offer.save
---
INSERT INTO `offers` (`price`, `response`, `created_at`, `product_id`, `token`, `updated_at`, `ip`, `counter`) VALUES(20.0, NULL, '2011-05-11 05:27:43', 1, 'Y4KSBf/dKOvG8+TVDhYyzC/v3S2NtynrMn6UnL+NUdE=', '2011-05-11 05:27:43', '172.18.100.97', 1)